Revit 2027 API
FamilyStructuralMaterialTypeFilter Constructor
Overload List
Name | Description
FamilyStructuralMaterialTypeFilter(StructuralMaterialType) |  Constructs a new instance of a filter to match families that have the given structural material type.
FamilyStructuralMaterialTypeFilter(StructuralMaterialType, Boolean) |  Constructs a new instance of a filter to match families by structural material type, with the option to match all families which are not of the given structural material type.
Top
See Also
Reference
FamilyStructuralMaterialTypeFilter Class
Autodesk.Revit.DB.Structure Namespace